tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "shivammathur/extensions"
tap "shivammathur/php"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Dependency Manager for PHP
brew "composer"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Isolated development environments using Docker
brew "docker-compose"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# GNU grep, egrep and fgrep
brew "grep"
# Apache HTTP server
brew "httpd", restart_service: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Mac App Store command-line interface
brew "mas"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Platform built on V8 to build network applications
brew "node@22", link: true
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Vi 'workalike' with many additional features
brew "vim"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Mongodb PHP extension
brew "shivammathur/extensions/mongodb@8.0"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# General-purpose scripting language
brew "shivammathur/php/php@8.1"
# General-purpose scripting language
brew "shivammathur/php/php@8.2"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Test localhost and staging websites
cask "browserstacklocal"
# Time tracking tool for agencies and freelancers
cask "clockify"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal built on web technologies
cask "hyper"
# HTTP and GraphQL Client
cask "insomnia"
# Menu bar manager
cask "jordanbaird-ice"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Software for Logitech devices
cask "logitech-options"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Monitors computer mic and webcam
cask "oversight"
# Protect your personal files
cask "ransomwhere"
# Window snapping tool
cask "rectangle-pro"
# Team communication and collaboration software
cask "slack"
# Personal online hard drive to store, view and share files
cask "stack"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Customizable email client
cask "thunderbird"
# Automatic time-tracking application
cask "timemator"
# Automatic time and productivity tracking app
cask "timing"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "AdBlock Pro", id: 1018301773
mas "AdGuard for Safari", id: 1440147259
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "heybourn.headwind"
vscode "humao.rest-client"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-duplicate"
vscode "pflannery.vscode-versionlens"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sidneys1.gitconfig"
vscode "stackbreak.comment-divider"
vscode "tamasfe.even-better-toml"
vscode "ulthes.theme-firewatch"
vscode "ultram4rine.vscode-choosealicense"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
