tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "romkatv/powerlevel10k"
tap "sass/sass"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Garbage collector for C and C++
brew "bdw-gc"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Mozilla CA certificate store
brew "ca-certificates"
# Cross-platform make
brew "cmake"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Isolated development environments using Docker
brew "docker-compose"
# Banner-like program prints strings as ASCII art
brew "figlet"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
# GNU multiple precision arithmetic library
brew "gmp"
# Generic library support script
brew "libtool"
# C string library for manipulating Unicode strings
brew "libunistring"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# HTTP/2 C Library
brew "libnghttp2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Platform built on V8 to build network applications
brew "node"
# Exposes your localhost to the world for easy testing and sharing
brew "localtunnel"
# Mac App Store command-line interface
brew "mas"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Text-based UI library
brew "ncurses"
# Perl compatible regular expressions library
brew "pcre"
# Python version management
brew "pyenv"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Messaging broker
brew "rabbitmq"
# Fork of Heirloom mailx
brew "s-nail"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Feature-rich console based todo list manager
brew "task"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Terminal multiplexer
brew "tmux"
# Language for application scale JavaScript development
brew "typescript"
# UNIX shell (command interpreter)
brew "zsh"
# SDK
brew "dart-lang/dart/dart"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Menu bar icon organizer
cask "bartender"
# Display management tool
cask "betterdisplay"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Icon set and toolkit
cask "font-fontawesome"
cask "font-meslo-for-powerline"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# Vector graphics editor
cask "inkscape"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Monitors computer mic and webcam
cask "oversight"
# All-in-one bookmark manager
cask "raindropio"
# Protect your personal files
cask "ransomwhere"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Digital design and prototyping platform
cask "sketch"
# Music streaming service
cask "spotify"
# Personal online hard drive to store, view and share files
cask "stack"
# System monitor for the menu bar
cask "stats"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Customizable email client
cask "thunderbird"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "AdBlock", id: 1402042596
mas "Connective Plugin", id: 1428740565
mas "Xcode", id: 497799835
