tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "ngrok/ngrok"
tap "romkatv/powerlevel10k"
tap "sass/sass"
brew "git"
brew "gnupg"
brew "jq"
brew "pyenv"
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "meetingbar"
cask "microsoft-edge"
cask "microsoft-teams"
cask "ngrok"
cask "notion"
cask "raindropio"
cask "sketch"
cask "spotify"
cask "stats"
cask "telegram"
cask "thunderbird"
cask "visual-studio-code"
